/**
*  @file    hw_hwa_commonreg.h
*
*  @brief
*    This file gives register definitions of DSS_HW_ACC module.
*
*
*
*/

/*
*   (C) Copyright 2019 - 2020, Texas Instruments Incorporated. - TI web address www.ti.com
*---------------------------------------------------------------------------------------
*
*  Redistribution and use in source and binary forms, with or without modification,
*  are permitted provided that the following conditions are met:
*
*    Redistributions of source code must retain the above copyright notice,
*    this list of conditions and the following disclaimer.
*
*    Redistributions in binary form must reproduce the above copyright notice,
*    this list of conditions and the following disclaimer in the documentation
*    and/or other materials provided with the distribution.
*
*    Neither the name of Texas Instruments Incorporated nor the names of its
*    contributors may be used to endorse or promote products derived from this
*    software without specific prior written permission.
*
*  THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
*  AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO,
*  THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
*  PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT  OWNER OR CONTRIBUTORS
*  BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
*  CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF

#define    ADDR_ERR_EN_CLR_START                                             (1U)
#define    ADDR_ERR_EN_CLR_END                                               (1U)

/* Definition for field PROT_ERR_EN_CLR in Register INTR_ENABLE_CLEAR */
#define    PROT_ERR_EN_CLR_START                                             (0U)
#define    PROT_ERR_EN_CLR_END                                               (0U)

/* Definition for field EOI_VECTOR in Register EOI */
#define    EOI_VECTOR_START                                                  (0U)
#define    EOI_VECTOR_END                                                    (7U)

/* Definition for field FAULT_ADDR in Register FAULT_ADDRESS */
#define    FAULT_ADDR_START                                                  (0U)
#define    FAULT_ADDR_END                                                    (31U)

/* Definition for field FAULT_NS in Register FAULT_TYPE_STATUS */
#define    FAULT_NS_START                                                    (6U)
#define    FAULT_NS_END                                                      (6U)

/* Definition for field FAULT_TYPE in Register FAULT_TYPE_STATUS */
#define    FAULT_TYPE_START                                                  (0U)
#define    FAULT_TYPE_END                                                    (5U)

/* Definition for field FAULT_XID in Register FAULT_ATTR_STATUS */
#define    FAULT_XID_START                                                   (20U)
#define    FAULT_XID_END                                                     (31U)

/* Definition for field FAULT_ROUTEID in Register FAULT_ATTR_STATUS */
#define    FAULT_ROUTEID_START                                               (8U)
#define    FAULT_ROUTEID_END                                                 (19U)

/* Definition for field FAULT_PRIVID in Register FAULT_ATTR_STATUS */
#define    FAULT_PRIVID_START                                                (0U)
#define    FAULT_PRIVID_END                                                  (7U)

/* Definition for field FAULT_CLR in Register FAULT_CLEAR */
#define    FAULT_CLR_START                                                   (0U)
#define    FAULT_CLR_END                                                     (0U)


/* Definition for CDF_CNT_BINNUM_SAMPLE in RAM HWA_HIST_THRESH_RAM  */
#define    CDF_CNT_BINNUM_SAMPLE_START                                       (24U)
#define    CDF_CNT_BINNUM_SAMPLE_END                                          (29U)

/* Definition for CDF_CNT_CDFVAL_SAMPLE in RAM HWA_HIST_THRESH_RAM  */
#define    CDF_CNT_CDFVAL_SAMPLE_START                                       (12U)
#define    CDF_CNT_CDFVAL_SAMPLE_END                                          (23U)

/* Definition for CDF_CNT_HISTVAL_SAMPLE in RAM HWA_HIST_THRESH_RAM  */
#define    CDF_CNT_HISTVAL_SAMPLE_START                                       (0U)
#define    CDF_CNT_HISTVAL_SAMPLE_END                                          (11U)

/** @struct hwaAccVal
*   @brief  HWA accumulator register data structure
*
*/
typedef volatile struct hwaAccVal_t
{
    uint32_t    accValLSB;        /* AddrOffset = 0x000 */
    uint32_t    accValMSB;        /* AddrOffset = 0x004 */
} hwaAccVal;


/**
 * @struct DSSHWACCRegs_t
 * @brief
 *   Module DSS_HW_ACC Register Definition
 * @details
 *   This structure is used to access the DSS_HW_ACC module registers.
 */
typedef volatile struct DSSHWACCRegs_t
{

    uint32_t      PID                                         ;      /* offset = 0x0000 */
    uint32_t      PARAM_RAM_IDX                               ;      /* offset = 0x0004 */
    uint32_t      PARAM_RAM_LOOP                              ;      /* offset = 0x0008 */
    uint32_t      PARAM_RAM_IDX_ALT                           ;      /* offset = 0x000C */
    uint32_t      PARAM_RAM_LOOP_ALT                          ;      /* offset = 0x0010 */
    uint32_t      HWA_ENABLE                                  ;      /* offset = 0x0014 */
    uint32_t      CS_CONFIG                                   ;      /* offset = 0x0018 */
    uint32_t      FW2DMA_TRIG                                 ;      /* offset = 0x001C */
    uint32_t      DMA2HWA_TRIG                                ;      /* offset = 0x0020 */
#if 0
    uint32_t      SIGDMACH0DONE                               ;      /* offset = 0x0024 */
    uint32_t      SIGDMACH1DONE                               ;      /* offset = 0x0028 */
    uint32_t      SIGDMACH2DONE                               ;      /* offset = 0x002C */
    uint32_t      SIGDMACH3DONE                               ;      /* offset = 0x0030 */
    uint32_t      SIGDMACH4DONE                               ;      /* offset = 0x0034 */
    uint32_t      SIGDMACH5DONE                               ;      /* offset = 0x0038 */
    uint32_t      SIGDMACH6DONE                               ;      /* offset = 0x003C */
    uint32_t      SIGDMACH7DONE                               ;      /* offset = 0x0040 */
    uint32_t      SIGDMACH8DONE                               ;      /* offset = 0x0044 */
    uint32_t      SIGDMACH9DONE                               ;      /* offset = 0x0048 */
    uint32_t      SIGDMACH10DONE                              ;      /* offset = 0x004C */
    uint32_t      SIGDMACH11DONE                              ;      /* offset = 0x0050 */
    uint32_t      SIGDMACH12DONE                              ;      /* offset = 0x0054 */
    uint32_t      SIGDMACH13DONE                              ;      /* offset = 0x0058 */
    uint32_t      SIGDMACH14DONE                              ;      /* offset = 0x005C */
    uint32_t      SIGDMACH15DONE                              ;      /* offset = 0x0060 */
    uint32_t      SIGDMACH16DONE                              ;      /* offset = 0x0064 */
    uint32_t      SIGDMACH17DONE                              ;      /* offset = 0x0068 */
    uint32_t      SIGDMACH18DONE                              ;      /* offset = 0x006C */
    uint32_t      SIGDMACH19DONE                              ;      /* offset = 0x0070 */
    uint32_t      SIGDMACH20DONE                              ;      /* offset = 0x0074 */
    uint32_t      SIGDMACH21DONE                              ;      /* offset = 0x0078 */
    uint32_t      SIGDMACH22DONE                              ;      /* offset = 0x007C */
    uint32_t      SIGDMACH23DONE                              ;      /* offset = 0x0080 */
    uint32_t      SIGDMACH24DONE                              ;      /* offset = 0x0084 */
    uint32_t      SIGDMACH25DONE                              ;      /* offset = 0x0088 */
    uint32_t      SIGDMACH26DONE                              ;      /* offset = 0x008C */
    uint32_t      SIGDMACH27DONE                              ;      /* offset = 0x0090 */
    uint32_t      SIGDMACH28DONE                              ;      /* offset = 0x0094 */
    uint32_t      SIGDMACH29DONE                              ;      /* offset = 0x0098 */
    uint32_t      SIGDMACH30DONE                              ;      /* offset = 0x009C */
    uint32_t      SIGDMACH31DONE                              ;      /* offset = 0x00A0 */
#endif
    uint32_t      SIGDMACHDONE[32]                            ;      /* offset = 0x0024 - 0x00A0 */
    uint32_t      FW2HWA_TRIG_0                               ;      /* offset = 0x00A4 */
    uint32_t      FW2HWA_TRIG_1                               ;      /* offset = 0x00A8 */
    uint32_t      CS_FW2ACC_TRIG                              ;      /* offset = 0x00AC */
#if 0
    uint32_t      BPM_PATTERN_0                               ;      /* offset = 0x00B0 */
    uint32_t      BPM_PATTERN_1                               ;      /* offset = 0x00B4 */
    uint32_t      BPM_PATTERN_2                               ;      /* offset = 0x00B8 */
    uint32_t      BPM_PATTERN_3                               ;      /* offset = 0x00BC */
    uint32_t      BPM_PATTERN_4                               ;      /* offset = 0x00C0 */
    uint32_t      BPM_PATTERN_5                               ;      /* offset = 0x00C4 */
    uint32_t      BPM_PATTERN_6                               ;      /* offset = 0x00C8 */
    uint32_t      BPM_PATTERN_7                               ;      /* offset = 0x00CC */
#endif
    uint32_t      BPM_PATTERN[8]                              ;      /* offset = 0x00B0 - 0x00CC */
    uint32_t      BPM_RATE                                    ;      /* offset = 0x00D0 */
#if 0
    uint32_t      PARAM_DONE_SET_STATUS_0                     ;      /* offset = 0x00D4 */
    uint32_t      PARAM_DONE_SET_STATUS_1                     ;      /* offset = 0x00D8 */
#endif
    uint32_t      PARAM_DONE_SET_STATUS[2]                    ;      /* offset = 0x00D4 - 0x00D8 */
#if 0
    uint32_t      PARAM_DONE_CLR_0                            ;      /* offset = 0x00DC */
    uint32_t      PARAM_DONE_CLR_1                            ;      /* offset = 0x00E0 */
#endif
    uint32_t      PARAM_DONE_CLR[2]                           ;      /* offset = 0x00DC - 0x00E0 */
#if 0
    uint32_t      TRIGGER_SET_STATUS_0                        ;      /* offset = 0x00E4 */
    uint32_t      TRIGGER_SET_STATUS_1                        ;      /* offset = 0x00E8 */
#endif
    uint32_t      TRIGGER_SET_STATUS[2]                       ;      /* offset = 0x00E4 - 0x00E8 */
#if 0
    uint32_t      TRIGGER_SET_IN_CLR_0                        ;      /* offset = 0x00EC */
    uint32_t      TRIGGER_SET_IN_CLR_1                        ;      /* offset = 0x00F0 */
#endif
    uint32_t      TRIGGER_SET_IN_CLR[2]                       ;      /* offset = 0x00EC - 0x00F0 */
    uint32_t      DC_EST_RESET_SW                             ;      /* offset = 0x00F4 */
    uint32_t      DC_EST_CTRL                                 ;      /* offset = 0x00F8 */
#if 0
    uint32_t      DC_EST_I_0_VAL                              ;      /* offset = 0x00FC */
    uint32_t      DC_EST_I_1_VAL                              ;      /* offset = 0x0100 */
    uint32_t      DC_EST_I_2_VAL                              ;      /* offset = 0x0104 */
    uint32_t      DC_EST_I_3_VAL                              ;      /* offset = 0x0108 */
    uint32_t      DC_EST_I_4_VAL                              ;      /* offset = 0x010C */
    uint32_t      DC_EST_I_5_VAL                              ;      /* offset = 0x0110 */
    uint32_t      DC_EST_I_6_VAL                              ;      /* offset = 0x0114 */
    uint32_t      DC_EST_I_7_VAL                              ;      /* offset = 0x0118 */
    uint32_t      DC_EST_I_8_VAL                              ;      /* offset = 0x011C */
    uint32_t      DC_EST_I_9_VAL                              ;      /* offset = 0x0120 */
    uint32_t      DC_EST_I_10_VAL                             ;      /* offset = 0x0124 */
    uint32_t      DC_EST_I_11_VAL                             ;      /* offset = 0x0128 */
#endif
    uint32_t      DC_EST_I_VAL[12]                            ;      /* offset = 0x00FC - 0x0128 */
#if 0
    uint32_t      DC_EST_Q_0_VAL                              ;      /* offset = 0x012C */
    uint32_t      DC_EST_Q_1_VAL                              ;      /* offset = 0x0130 */
    uint32_t      DC_EST_Q_2_VAL                              ;      /* offset = 0x0134 */
    uint32_t      DC_EST_Q_3_VAL                              ;      /* offset = 0x0138 */
    uint32_t      DC_EST_Q_4_VAL                              ;      /* offset = 0x013C */
    uint32_t      DC_EST_Q_5_VAL                              ;      /* offset = 0x0140 */
    uint32_t      DC_EST_Q_6_VAL                              ;      /* offset = 0x0144 */
    uint32_t      DC_EST_Q_7_VAL                              ;      /* offset = 0x0148 */
    uint32_t      DC_EST_Q_8_VAL                              ;      /* offset = 0x014C */
    uint32_t      DC_EST_Q_9_VAL                              ;      /* offset = 0x0150 */
    uint32_t      DC_EST_Q_10_VAL                             ;      /* offset = 0x0154 */
    uint32_t      DC_EST_Q_11_VAL                             ;      /* offset = 0x0158 */
#endif
    uint32_t      DC_EST_Q_VAL[12]                            ;      /* offset = 0x012C - 0x0158 */
#if 0
    uint32_t      DC_ACC_I_0_VAL_LSB                          ;      /* offset = 0x015C */
    uint32_t      DC_ACC_I_0_VAL_MSB                          ;      /* offset = 0x0160 */
    uint32_t      DC_ACC_I_1_VAL_LSB                          ;      /* offset = 0x0164 */
    uint32_t      DC_ACC_I_1_VAL_MSB                          ;      /* offset = 0x0168 */
    uint32_t      DC_ACC_I_2_VAL_LSB                          ;      /* offset = 0x016C */
    uint32_t      DC_ACC_I_2_VAL_MSB                          ;      /* offset = 0x0170 */
    uint32_t      DC_ACC_I_3_VAL_LSB                          ;      /* offset = 0x0174 */
    uint32_t      DC_ACC_I_3_VAL_MSB                          ;      /* offset = 0x0178 */
    uint32_t      DC_ACC_I_4_VAL_LSB                          ;      /* offset = 0x017C */
    uint32_t      DC_ACC_I_4_VAL_MSB                          ;      /* offset = 0x0180 */
    uint32_t      DC_ACC_I_5_VAL_LSB                          ;      /* offset = 0x0184 */
    uint32_t      DC_ACC_I_5_VAL_MSB                          ;      /* offset = 0x0188 */
    uint32_t      DC_ACC_I_6_VAL_LSB                          ;      /* offset = 0x018C */
    uint32_t      DC_ACC_I_6_VAL_MSB                          ;      /* offset = 0x0190 */
    uint32_t      DC_ACC_I_7_VAL_LSB                          ;      /* offset = 0x0194 */
    uint32_t      DC_ACC_I_7_VAL_MSB                          ;      /* offset = 0x0198 */
    uint32_t      DC_ACC_I_8_VAL_LSB                          ;      /* offset = 0x019C */
    uint32_t      DC_ACC_I_8_VAL_MSB                          ;      /* offset = 0x01A0 */
    uint32_t      DC_ACC_I_9_VAL_LSB                          ;      /* offset = 0x01A4 */
    uint32_t      DC_ACC_I_9_VAL_MSB                          ;      /* offset = 0x01A8 */
    uint32_t      DC_ACC_I_10_VAL_LSB                         ;      /* offset = 0x01AC */
    uint32_t      DC_ACC_I_10_VAL_MSB                         ;      /* offset = 0x01B0 */
    uint32_t      DC_ACC_I_11_VAL_LSB                         ;      /* offset = 0x01B4 */
    uint32_t      DC_ACC_I_11_VAL_MSB                         ;      /* offset = 0x01B8 */
#endif
    hwaAccVal     DC_ACC_I_VAL[12]                ;      /* offset = 0x015C - 0x01B8 */
#if 0
    uint32_t      DC_ACC_Q_0_VAL_LSB                          ;      /* offset = 0x01BC */
    uint32_t      DC_ACC_Q_0_VAL_MSB                          ;      /* offset = 0x01C0 */
    uint32_t      DC_ACC_Q_1_VAL_LSB                          ;      /* offset = 0x01C4 */
    uint32_t      DC_ACC_Q_1_VAL_MSB                          ;      /* offset = 0x01C8 */
    uint32_t      DC_ACC_Q_2_VAL_LSB                          ;      /* offset = 0x01CC */
    uint32_t      DC_ACC_Q_2_VAL_MSB                          ;      /* offset = 0x01D0 */
    uint32_t      DC_ACC_Q_3_VAL_LSB                          ;      /* offset = 0x01D4 */
    uint32_t      DC_ACC_Q_3_VAL_MSB                          ;      /* offset = 0x01D8 */
    uint32_t      DC_ACC_Q_4_VAL_LSB                          ;      /* offset = 0x01DC */
    uint32_t      DC_ACC_Q_4_VAL_MSB                          ;      /* offset = 0x01E0 */
    uint32_t      DC_ACC_Q_5_VAL_LSB                          ;      /* offset = 0x01E4 */
    uint32_t      DC_ACC_Q_5_VAL_MSB                          ;      /* offset = 0x01E8 */
    uint32_t      DC_ACC_Q_6_VAL_LSB                          ;      /* offset = 0x01EC */
    uint32_t      DC_ACC_Q_6_VAL_MSB                          ;      /* offset = 0x01F0 */
    uint32_t      DC_ACC_Q_7_VAL_LSB                          ;      /* offset = 0x01F4 */
    uint32_t      DC_ACC_Q_7_VAL_MSB                          ;      /* offset = 0x01F8 */
    uint32_t      DC_ACC_Q_8_VAL_LSB                          ;      /* offset = 0x01FC */
    uint32_t      DC_ACC_Q_8_VAL_MSB                          ;      /* offset = 0x0200 */
    uint32_t      DC_ACC_Q_9_VAL_LSB                          ;      /* offset = 0x0204 */
    uint32_t      DC_ACC_Q_9_VAL_MSB                          ;      /* offset = 0x0208 */
    uint32_t      DC_ACC_Q_10_VAL_LSB                         ;      /* offset = 0x020C */
    uint32_t      DC_ACC_Q_10_VAL_MSB                         ;      /* offset = 0x0210 */
    uint32_t      DC_ACC_Q_11_VAL_LSB                         ;      /* offset = 0x0214 */
    uint32_t      DC_ACC_Q_11_VAL_MSB                         ;      /* offset = 0x0218 */
#endif
    hwaAccVal     DC_ACC_Q_VAL[12]                ;      /* offset = 0x01BC - 0x0218 */
    uint32_t      DC_ACC_CLIP_STATUS                          ;      /* offset = 0x021C */
    uint32_t      DC_EST_CLIP_STATUS                          ;      /* offset = 0x0220 */
#if 0
    uint32_t      DC_I0_SW                                    ;      /* offset = 0x0224 */
    uint32_t      DC_I1_SW                                    ;      /* offset = 0x0228 */
    uint32_t      DC_I2_SW                                    ;      /* offset = 0x022C */
    uint32_t      DC_I3_SW                                    ;      /* offset = 0x0230 */
    uint32_t      DC_I4_SW                                    ;      /* offset = 0x0234 */
    uint32_t      DC_I5_SW                                    ;      /* offset = 0x0238 */
    uint32_t      DC_I6_SW                                    ;      /* offset = 0x023C */
    uint32_t      DC_I7_SW                                    ;      /* offset = 0x0240 */
    uint32_t      DC_I8_SW                                    ;      /* offset = 0x0244 */
    uint32_t      DC_I9_SW                                    ;      /* offset = 0x0248 */
    uint32_t      DC_I10_SW                                   ;      /* offset = 0x024C */
    uint32_t      DC_I11_SW                                   ;      /* offset = 0x0250 */
#endif
    uint32_t      DC_I_SW[12]                                 ;      /* offset = 0x0224 - 0x0250 */
#if 0
    uint32_t      DC_Q0_SW                                    ;      /* offset = 0x0254 */
    uint32_t      DC_Q1_SW                                    ;      /* offset = 0x0258 */
    uint32_t      DC_Q2_SW                                    ;      /* offset = 0x025C */
    uint32_t      DC_Q3_SW                                    ;      /* offset = 0x0260 */
    uint32_t      DC_Q4_SW                                    ;      /* offset = 0x0264 */
    uint32_t      DC_Q5_SW                                    ;      /* offset = 0x0268 */
    uint32_t      DC_Q6_SW                                    ;      /* offset = 0x026C */
    uint32_t      DC_Q7_SW                                    ;      /* offset = 0x0270 */
    uint32_t      DC_Q8_SW                                    ;      /* offset = 0x0274 */
    uint32_t      DC_Q9_SW                                    ;      /* offset = 0x0278 */
    uint32_t      DC_Q10_SW                                   ;      /* offset = 0x027C */
    uint32_t      DC_Q11_SW                                   ;      /* offset = 0x0280 */
#endif
    uint32_t      DC_Q_SW[12]                                 ;      /* offset = 0x0254 - 0x0280 */
    uint32_t      DC_SUB_CLIP                                 ;      /* offset = 0x0284 */
    uint32_t      DC_RESERVED_2                               ;      /* offset = 0x0288 */
    uint32_t      DC_RESERVED_3                               ;      /* offset = 0x028C */
    uint32_t      DC_RESERVED_4                               ;      /* offset = 0x0290 */
    uint32_t      DC_RESERVED_5                               ;      /* offset = 0x0294 */
    uint32_t      INTF_STATS_RESET_SW                         ;      /* offset = 0x0298 */
    uint32_t      INTF_STATS_CTRL                             ;      /* offset = 0x029C */
#if 0
    uint32_t      INTF_LOC_THRESH_MAG0_VAL                    ;      /* offset = 0x02A0 */
    uint32_t      INTF_LOC_THRESH_MAG1_VAL                    ;      /* offset = 0x02A4 */
    uint32_t      INTF_LOC_THRESH_MAG2_VAL                    ;      /* offset = 0x02A8 */
    uint32_t      INTF_LOC_THRESH_MAG3_VAL                    ;      /* offset = 0x02AC */
    uint32_t      INTF_LOC_THRESH_MAG4_VAL                    ;      /* offset = 0x02B0 */
    uint32_t      INTF_LOC_THRESH_MAG5_VAL                    ;      /* offset = 0x02B4 */
    uint32_t      INTF_LOC_THRESH_MAG6_VAL                    ;      /* offset = 0x02B8 */
    uint32_t      INTF_LOC_THRESH_MAG7_VAL                    ;      /* offset = 0x02BC */
    uint32_t      INTF_LOC_THRESH_MAG8_VAL                    ;      /* offset = 0x02C0 */
    uint32_t      INTF_LOC_THRESH_MAG9_VAL                    ;      /* offset = 0x02C4 */
    uint32_t      INTF_LOC_THRESH_MAG10_VAL                   ;      /* offset = 0x02C8 */
    uint32_t      INTF_LOC_THRESH_MAG11_VAL                   ;      /* offset = 0x02CC */
#endif
    uint32_t      INTF_LOC_THRESH_MAG_VAL[12]                 ;      /* offset = 0x02A0 - 0x02CC */
#if 0
    uint32_t      INTF_LOC_THRESH_MAGDIFF0_VAL                ;      /* offset = 0x02D0 */
    uint32_t      INTF_LOC_THRESH_MAGDIFF1_VAL                ;      /* offset = 0x02D4 */
    uint32_t      INTF_LOC_THRESH_MAGDIFF2_VAL                ;      /* offset = 0x02D8 */
    uint32_t      INTF_LOC_THRESH_MAGDIFF3_VAL                ;      /* offset = 0x02DC */
    uint32_t      INTF_LOC_THRESH_MAGDIFF4_VAL                ;      /* offset = 0x02E0 */
    uint32_t      INTF_LOC_THRESH_MAGDIFF5_VAL                ;      /* offset = 0x02E4 */
    uint32_t      INTF_LOC_THRESH_MAGDIFF6_VAL                ;      /* offset = 0x02E8 */
    uint32_t      INTF_LOC_THRESH_MAGDIFF7_VAL                ;      /* offset = 0x02EC */
    uint32_t      INTF_LOC_THRESH_MAGDIFF8_VAL                ;      /* offset = 0x02F0 */
    uint32_t      INTF_LOC_THRESH_MAGDIFF9_VAL                ;      /* offset = 0x02F4 */
    uint32_t      INTF_LOC_THRESH_MAGDIFF10_VAL               ;      /* offset = 0x02F8 */
    uint32_t      INTF_LOC_THRESH_MAGDIFF11_VAL               ;      /* offset = 0x02FC */
#endif
    uint32_t      INTF_LOC_THRESH_MAGDIFF_VAL[12]             ;      /* offset = 0x02D0 - 0x02FC */
    uint32_t      INTF_LOC_COUNT_ALL_CHIRP                    ;      /* offset = 0x0300 */
    uint32_t      INTF_LOC_COUNT_ALL_FRAME                    ;      /* offset = 0x0304 */
#if 0
    uint32_t      INTF_STATS_MAG_ACC_0_LSB                    ;      /* offset = 0x0308 */
    uint32_t      INTF_STATS_MAG_ACC_0_MSB                    ;      /* offset = 0x030C */
    uint32_t      INTF_STATS_MAG_ACC_1_LSB                    ;      /* offset = 0x0310 */
    uint32_t      INTF_STATS_MAG_ACC_1_MSB                    ;      /* offset = 0x0314 */
    uint32_t      INTF_STATS_MAG_ACC_2_LSB                    ;      /* offset = 0x0318 */
    uint32_t      INTF_STATS_MAG_ACC_2_MSB                    ;      /* offset = 0x031C */
    uint32_t      INTF_STATS_MAG_ACC_3_LSB                    ;      /* offset = 0x0320 */
    uint32_t      INTF_STATS_MAG_ACC_3_MSB                    ;      /* offset = 0x0324 */
    uint32_t      INTF_STATS_MAG_ACC_4_LSB                    ;      /* offset = 0x0328 */
    uint32_t      INTF_STATS_MAG_ACC_4_MSB                    ;      /* offset = 0x032C */
    uint32_t      INTF_STATS_MAG_ACC_5_LSB                    ;      /* offset = 0x0330 */
    uint32_t      INTF_STATS_MAG_ACC_5_MSB                    ;      /* offset = 0x0334 */
    uint32_t      INTF_STATS_MAG_ACC_6_LSB                    ;      /* offset = 0x0338 */
    uint32_t      INTF_STATS_MAG_ACC_6_MSB                    ;      /* offset = 0x033C */
    uint32_t      INTF_STATS_MAG_ACC_7_LSB                    ;      /* offset = 0x0340 */
    uint32_t      INTF_STATS_MAG_ACC_7_MSB                    ;      /* offset = 0x0344 */
    uint32_t      INTF_STATS_MAG_ACC_8_LSB                    ;      /* offset = 0x0348 */
    uint32_t      INTF_STATS_MAG_ACC_8_MSB                    ;      /* offset = 0x034C */
    uint32_t      INTF_STATS_MAG_ACC_9_LSB                    ;      /* offset = 0x0350 */
    uint32_t      INTF_STATS_MAG_ACC_9_MSB                    ;      /* offset = 0x0354 */
    uint32_t      INTF_STATS_MAG_ACC_10_LSB                   ;      /* offset = 0x0358 */
    uint32_t      INTF_STATS_MAG_ACC_10_MSB                   ;      /* offset = 0x035C */
    uint32_t      INTF_STATS_MAG_ACC_11_LSB                   ;      /* offset = 0x0360 */
    uint32_t      INTF_STATS_MAG_ACC_11_MSB                   ;      /* offset = 0x0364 */
#endif
    hwaAccVal     INTF_STATS_MAG_ACC[12]          ;      /* offset = 0x0308 - 0x0364 */
#if 0
    uint32_t      INTF_STATS_MAGDIFF_ACC_0_LSB                ;      /* offset = 0x0368 */
    uint32_t      INTF_STATS_MAGDIFF_ACC_0_MSB                ;      /* offset = 0x036C */
    uint32_t      INTF_STATS_MAGDIFF_ACC_1_LSB                ;      /* offset = 0x0370 */
    uint32_t      INTF_STATS_MAGDIFF_ACC_1_MSB                ;      /* offset = 0x0374 */
    uint32_t      INTF_STATS_MAGDIFF_ACC_2_LSB                ;      /* offset = 0x0378 */
    uint32_t      INTF_STATS_MAGDIFF_ACC_2_MSB                ;      /* offset = 0x037C */
    uint32_t      INTF_STATS_MAGDIFF_ACC_3_LSB                ;      /* offset = 0x0380 */
    uint32_t      INTF_STATS_MAGDIFF_ACC_3_MSB                ;      /* offset = 0x0384 */
    uint32_t      INTF_STATS_MAGDIFF_ACC_4_LSB                ;      /* offset = 0x0388 */
    uint32_t      INTF_STATS_MAGDIFF_ACC_4_MSB                ;      /* offset = 0x038C */
    uint32_t      INTF_STATS_MAGDIFF_ACC_5_LSB                ;      /* offset = 0x0390 */
    uint32_t      INTF_STATS_MAGDIFF_ACC_5_MSB                ;      /* offset = 0x0394 */
    uint32_t      INTF_STATS_MAGDIFF_ACC_6_LSB                ;      /* offset = 0x0398 */
    uint32_t      INTF_STATS_MAGDIFF_ACC_6_MSB                ;      /* offset = 0x039C */
    uint32_t      INTF_STATS_MAGDIFF_ACC_7_LSB                ;      /* offset = 0x03A0 */
    uint32_t      INTF_STATS_MAGDIFF_ACC_7_MSB                ;      /* offset = 0x03A4 */
    uint32_t      INTF_STATS_MAGDIFF_ACC_8_LSB                ;      /* offset = 0x03A8 */
    uint32_t      INTF_STATS_MAGDIFF_ACC_8_MSB                ;      /* offset = 0x03AC */
    uint32_t      INTF_STATS_MAGDIFF_ACC_9_LSB                ;      /* offset = 0x03B0 */
    uint32_t      INTF_STATS_MAGDIFF_ACC_9_MSB                ;      /* offset = 0x03B4 */
    uint32_t      INTF_STATS_MAGDIFF_ACC_10_LSB               ;      /* offset = 0x03B8 */
    uint32_t      INTF_STATS_MAGDIFF_ACC_10_MSB               ;      /* offset = 0x03BC */
    uint32_t      INTF_STATS_MAGDIFF_ACC_11_LSB               ;      /* offset = 0x03C0 */
    uint32_t      INTF_STATS_MAGDIFF_ACC_11_MSB               ;      /* offset = 0x03C4 */
#endif
    hwaAccVal     INTF_STATS_MAGDIFF_ACC[12]        ;      /* offset = 0x0368 - 0x03C4 */
#if 0
    uint32_t      INTF_LOC_THRESH_MAG0_SW                     ;      /* offset = 0x03C8 */
    uint32_t      INTF_LOC_THRESH_MAG1_SW                     ;      /* offset = 0x03CC */
    uint32_t      INTF_LOC_THRESH_MAG2_SW                     ;      /* offset = 0x03D0 */
    uint32_t      INTF_LOC_THRESH_MAG3_SW                     ;      /* offset = 0x03D4 */
    uint32_t      INTF_LOC_THRESH_MAG4_SW                     ;      /* offset = 0x03D8 */
    uint32_t      INTF_LOC_THRESH_MAG5_SW                     ;      /* offset = 0x03DC */
    uint32_t      INTF_LOC_THRESH_MAG6_SW                     ;      /* offset = 0x03E0 */
    uint32_t      INTF_LOC_THRESH_MAG7_SW                     ;      /* offset = 0x03E4 */
    uint32_t      INTF_LOC_THRESH_MAG8_SW                     ;      /* offset = 0x03E8 */
    uint32_t      INTF_LOC_THRESH_MAG9_SW                     ;      /* offset = 0x03EC */
    uint32_t      INTF_LOC_THRESH_MAG10_SW                    ;      /* offset = 0x03F0 */
    uint32_t      INTF_LOC_THRESH_MAG11_SW                    ;      /* offset = 0x03F4 */
#endif
    uint32_t      INTF_LOC_THRESH_MAG_SW[12]                  ;      /* offset = 0x03C8 - 0x03F4 */
#if 0
    uint32_t      INTF_LOC_THRESH_MAGDIFF0_SW                 ;      /* offset = 0x03F8 */
    uint32_t      INTF_LOC_THRESH_MAGDIFF1_SW                 ;      /* offset = 0x03FC */
    uint32_t      INTF_LOC_THRESH_MAGDIFF2_SW                 ;      /* offset = 0x0400 */
    uint32_t      INTF_LOC_THRESH_MAGDIFF3_SW                 ;      /* offset = 0x0404 */
    uint32_t      INTF_LOC_THRESH_MAGDIFF4_SW                 ;      /* offset = 0x0408 */
    uint32_t      INTF_LOC_THRESH_MAGDIFF5_SW                 ;      /* offset = 0x040C */
    uint32_t      INTF_LOC_THRESH_MAGDIFF6_SW                 ;      /* offset = 0x0410 */
    uint32_t      INTF_LOC_THRESH_MAGDIFF7_SW                 ;      /* offset = 0x0414 */
    uint32_t      INTF_LOC_THRESH_MAGDIFF8_SW                 ;      /* offset = 0x0418 */
    uint32_t      INTF_LOC_THRESH_MAGDIFF9_SW                 ;      /* offset = 0x041C */
    uint32_t      INTF_LOC_THRESH_MAGDIFF10_SW                ;      /* offset = 0x0420 */
    uint32_t      INTF_LOC_THRESH_MAGDIFF11_SW                ;      /* offset = 0x0424 */
#endif
    uint32_t      INTF_LOC_THRESH_MAGDIFF_SW[12]              ;      /* offset = 0x03F8 - 0x0424 */
    uint32_t      INTF_STATS_ACC_CLIP_STATUS                  ;      /* offset = 0x0428 */
    uint32_t      INTF_STATS_THRESH_CLIP_STATUS               ;      /* offset = 0x042C */
#if 0
    uint32_t      INTF_MITG_WINDOW_PARAM_0                    ;      /* offset = 0x0430 */
    uint32_t      INTF_MITG_WINDOW_PARAM_1                    ;      /* offset = 0x0434 */
    uint32_t      INTF_MITG_WINDOW_PARAM_2                    ;      /* offset = 0x0438 */
    uint32_t      INTF_MITG_WINDOW_PARAM_3                    ;      /* offset = 0x043C */
    uint32_t      INTF_MITG_WINDOW_PARAM_4                    ;      /* offset = 0x0440 */
#endif
    uint32_t      INTF_MITG_WINDOW_PARAM[5]                   ;      /* offset = 0x0430 - 0x0440 */
    uint32_t      INTF_STATS_SUM_MAG_VAL                      ;      /* offset = 0x0444 */
    uint32_t      INTF_STATS_SUM_MAG_VAL_CLIP_STATUS          ;      /* offset = 0x0448 */
    uint32_t      INTF_STATS_SUM_MAGDIFF_VAL                  ;      /* offset = 0x044C */
    uint32_t      INTF_STATS_SUM_MAGDIFF_VAL_CLIP_STATUS        ;      /* offset = 0x0450 */
    uint32_t      INTERF_RESERVED_5                           ;      /* offset = 0x0454 */
#if 0
    uint32_t      ICMULT_SCALE0                               ;      /* offset = 0x0458 */
    uint32_t      ICMULT_SCALE1                               ;      /* offset = 0x045C */
    uint32_t      ICMULT_SCALE2                               ;      /* offset = 0x0460 */
    uint32_t      ICMULT_SCALE3                               ;      /* offset = 0x0464 */
    uint32_t      ICMULT_SCALE4                               ;      /* offset = 0x0468 */
    uint32_t      ICMULT_SCALE5                               ;      /* offset = 0x046C */
    uint32_t      ICMULT_SCALE6                               ;      /* offset = 0x0470 */
    uint32_t      ICMULT_SCALE7                               ;      /* offset = 0x0474 */
    uint32_t      ICMULT_SCALE8                               ;      /* offset = 0x0478 */
    uint32_t      ICMULT_SCALE9                               ;      /* offset = 0x047C */
    uint32_t      ICMULT_SCALE10                              ;      /* offset = 0x0480 */
    uint32_t      ICMULT_SCALE11                              ;      /* offset = 0x0484 */
#endif
    uint32_t      ICMULT_SCALE[12]                            ;      /* offset = 0x0458 - 0x0484 */
#if 0
    uint32_t      QCMULT_SCALE0                               ;      /* offset = 0x0488 */
    uint32_t      QCMULT_SCALE1                               ;      /* offset = 0x048C */
    uint32_t      QCMULT_SCALE2                               ;      /* offset = 0x0490 */
    uint32_t      QCMULT_SCALE3                               ;      /* offset = 0x0494 */
    uint32_t      QCMULT_SCALE4                               ;      /* offset = 0x0498 */
    uint32_t      QCMULT_SCALE5                               ;      /* offset = 0x049C */
    uint32_t      QCMULT_SCALE6                               ;      /* offset = 0x04A0 */
    uint32_t      QCMULT_SCALE7                               ;      /* offset = 0x04A4 */
    uint32_t      QCMULT_SCALE8                               ;      /* offset = 0x04A8 */
    uint32_t      QCMULT_SCALE9                               ;      /* offset = 0x04AC */
    uint32_t      QCMULT_SCALE10                              ;      /* offset = 0x04B0 */
    uint32_t      QCMULT_SCALE11                              ;      /* offset = 0x04B4 */
#endif
    uint32_t      QCMULT_SCALE[12]                            ;      /* offset = 0x0488 - 0x04B4 */
    uint32_t      TWID_INCR_DELTA_FRAC                        ;      /* offset = 0x04B8 */
    uint32_t      RECWIN_RESET_SW                             ;      /* offset = 0x04BC */
    uint32_t      TWID_INCR_DELTA_FRAC_RESET_SW               ;      /* offset = 0x04C0 */
    uint32_t      TWID_INCR_DELTA_FRAC_CLIP_STATUS            ;      /* offset = 0x04C4 */
    uint32_t      RECWIN_INIT_KVAL                            ;      /* offset = 0x04C8 */
    uint32_t      CMULT_RESERVED_2                            ;      /* offset = 0x04CC */
    uint32_t      CHAN_COMB_SIZE                              ;      /* offset = 0x04D0 */
#if 0
    uint32_t      CHAN_COMB_VEC_0                             ;      /* offset = 0x04D4 */
    uint32_t      CHAN_COMB_VEC_1                             ;      /* offset = 0x04D8 */
    uint32_t      CHAN_COMB_VEC_2                             ;      /* offset = 0x04DC */
    uint32_t      CHAN_COMB_VEC_3                             ;      /* offset = 0x04E0 */
    uint32_t      CHAN_COMB_VEC_4                             ;      /* offset = 0x04E4 */
    uint32_t      CHAN_COMB_VEC_5                             ;      /* offset = 0x04E8 */
    uint32_t      CHAN_COMB_VEC_6                             ;      /* offset = 0x04EC */
    uint32_t      CHAN_COMB_VEC_7                             ;      /* offset = 0x04F0 */
#endif
    uint32_t      CHAN_COMB_VEC[8]                            ;      /* offset = 0x04D4 - 0x04F0 */
    uint32_t      CHANNEL_COMB_CLIP_STATUS                    ;      /* offset = 0x04F4 */
    uint32_t      ZERO_INSERT_NUM                             ;      /* offset = 0x04F8 */
#if 0
    uint32_t      ZERO_INSERT_MASK_0                          ;      /* offset = 0x04FC */
    uint32_t      ZERO_INSERT_MASK_1                          ;      /* offset = 0x0500 */
    uint32_t      ZERO_INSERT_MASK_2                          ;      /* offset = 0x0504 */
    uint32_t      ZERO_INSERT_MASK_3                          ;      /* offset = 0x0508 */
    uint32_t      ZERO_INSERT_MASK_4                          ;      /* offset = 0x050C */
    uint32_t      ZERO_INSERT_MASK_5                          ;      /* offset = 0x0510 */
    uint32_t      ZERO_INSERT_MASK_6                          ;      /* offset = 0x0514 */
    uint32_t      ZERO_INSERT_MASK_7                          ;      /* offset = 0x0518 */
#endif
    uint32_t      ZERO_INSERT_MASK[8]                         ;      /* offset = 0x04FC - 0x0518 */
    uint32_t      ZERO_INSERT_RESERVED_1                      ;      /* offset = 0x051C */
    uint32_t      ZERO_INSERT_RESERVED_2                      ;      /* offset = 0x0520 */
    uint32_t      ZERO_INSERT_RESERVED_3                      ;      /* offset = 0x0524 */
    uint32_t      ZERO_INSERT_RESERVED_4                      ;      /* offset = 0x0528 */
    uint32_t      LFSR_SEED                                   ;      /* offset = 0x052C */
    uint32_t      LFSR_LOAD                                   ;      /* offset = 0x0530 */
    uint32_t      DITHER_TWID_EN                              ;      /* offset = 0x0534 */
    uint32_t      FFT_CLIP                                    ;      /* offset = 0x0538 */
    uint32_t      CLR_FFTCLIP                                 ;      /* offset = 0x053C */
    uint32_t      CLR_CLIP_MISC                               ;      /* offset = 0x0540 */
    uint32_t      IP_OP_FORMATTER_CLIP_STATUS                 ;      /* offset = 0x0544 */
    uint32_t      FFT_RESERVED_1                              ;      /* offset = 0x0548 */
    uint32_t      FFT_RESERVED_2                              ;      /* offset = 0x054C */
    uint32_t      FFT_RESERVED_3                              ;      /* offset = 0x0550 */
#if 0
    uint32_t      MAX1_VALUE                                  ;      /* offset = 0x0554 */
    uint32_t      MAX2_VALUE                                  ;      /* offset = 0x0558 */
    uint32_t      MAX3_VALUE                                  ;      /* offset = 0x055C */
    uint32_t      MAX4_VALUE                                  ;      /* offset = 0x0560 */
#endif
    uint32_t      MAX_VALUE[4]                                ;      /* offset = 0x0554 - 0x0560*/
#if 0
    uint32_t      MAX1_INDEX                                  ;      /* offset = 0x0564 */
    uint32_t      MAX2_INDEX                                  ;      /* offset = 0x0568 */
    uint32_t      MAX3_INDEX                                  ;      /* offset = 0x056C */
    uint32_t      MAX4_INDEX                                  ;      /* offset = 0x0570 */
#endif
    uint32_t      MAX_INDEX[4]                                ;      /* offset = 0x0564 - 0x0570*/
#if 0
    uint32_t      I_SUM1_LSB                                  ;      /* offset = 0x0574 */
    uint32_t      I_SUM1_MSB                                  ;      /* offset = 0x0578 */
    uint32_t      I_SUM2_LSB                                  ;      /* offset = 0x057C */
    uint32_t      I_SUM2_MSB                                  ;      /* offset = 0x0580 */
    uint32_t      I_SUM3_LSB                                  ;      /* offset = 0x0584 */
    uint32_t      I_SUM3_MSB                                  ;      /* offset = 0x0588 */
    uint32_t      I_SUM4_LSB                                  ;      /* offset = 0x058C */
    uint32_t      I_SUM4_MSB                                  ;      /* offset = 0x0590 */

#endif
    hwaAccVal     I_SUM_VALUE[4]                              ;      /* offset = 0x0574 - 0x0590*/
#if 0
    uint32_t      Q_SUM1_LSB                                  ;      /* offset = 0x0594 */
    uint32_t      Q_SUM1_MSB                                  ;      /* offset = 0x0598 */
    uint32_t      Q_SUM2_LSB                                  ;      /* offset = 0x059C */
    uint32_t      Q_SUM2_MSB                                  ;      /* offset = 0x05A0 */
    uint32_t      Q_SUM3_LSB                                  ;      /* offset = 0x05A4 */
    uint32_t      Q_SUM3_MSB                                  ;      /* offset = 0x05A8 */
    uint32_t      Q_SUM4_LSB                                  ;      /* offset = 0x05AC */
    uint32_t      Q_SUM4_MSB                                  ;      /* offset = 0x05B0 */
#endif
    hwaAccVal     Q_SUM_VALUE[4]                              ;      /* offset = 0x0594 - 0x05B0*/
    uint32_t      FFTSUMDIV                                   ;      /* offset = 0x05B4 */
    uint32_t      MAX2D_OFFSET_DIM1                           ;      /* offset = 0x05B8 */
    uint32_t      MAX2D_OFFSET_DIM2                           ;      /* offset = 0x05BC */
    uint32_t      CDF_CNT_THRESH                              ;      /* offset = 0x05C0 */
    uint32_t      STATS_RESERVED_1                            ;      /* offset = 0x05C4 */
    uint32_t      STATS_RESERVED_2                            ;      /* offset = 0x05C8 */
    uint32_t      STATS_RESERVED_3                            ;      /* offset = 0x05CC */
    uint32_t      STATS_RESERVED_4                            ;      /* offset = 0x05D0 */
    uint32_t      STATS_RESERVED_5                            ;      /* offset = 0x05D4 */
    uint32_t      CFAR_PEAKCNT                                ;      /* offset = 0x05D8 */
    uint32_t      CFAR_DET_THR                                ;      /* offset = 0x05DC */
    uint32_t      CFAR_TEST_REG                               ;      /* offset = 0x05E0 */
    uint32_t      CFAR_THRESH                                 ;      /* offset = 0x05E4 */
    uint32_t      CFAR_RESERVED_1                             ;      /* offset = 0x05E8 */
    uint32_t      CFAR_RESERVED_2                             ;      /* offset = 0x05EC */
    uint32_t      CFAR_RESERVED_3                             ;      /* offset = 0x05F0 */
    uint32_t      CFAR_RESERVED_4                             ;      /* offset = 0x05F4 */
    uint32_t      CMP_EGE_K0123                               ;      /* offset = 0x05F8 */
    uint32_t      CMP_EGE_K4567                               ;      /* offset = 0x05FC */
    uint32_t      MEM_INIT_START                              ;      /* offset = 0x0600 */
    uint32_t      MEM_INIT_DONE                               ;      /* offset = 0x0604 */
    uint32_t      MEM_INIT_STATUS                             ;      /* offset = 0x0608 */
    uint32_t      LM_THRESH_VAL                               ;      /* offset = 0x060C */
    uint32_t      LM_2DSTATS_BASE_ADDR                        ;      /* offset = 0x0610 */
    uint32_t      HWA_SAFETY_EN                               ;      /* offset = 0x0614 */
    uint32_t      HWA_SAFETY_ERR_MASK                         ;      /* offset = 0x0618 */
    uint32_t      HWA_SAFETY_ERR_STATUS                       ;      /* offset = 0x061C */
    uint32_t      HWA_SAFETY_ERR_STATUS_RAW                   ;      /* offset = 0x0620 */
#if 0
    uint32_t      HWA_SAFETY_DMEM0_ERR_ADDR                   ;      /* offset = 0x0624 */
    uint32_t      HWA_SAFETY_DMEM1_ERR_ADDR                   ;      /* offset = 0x0628 */
    uint32_t      HWA_SAFETY_DMEM2_ERR_ADDR                   ;      /* offset = 0x062C */
    uint32_t      HWA_SAFETY_DMEM3_ERR_ADDR                   ;      /* offset = 0x0630 */
    uint32_t      HWA_SAFETY_DMEM4_ERR_ADDR                   ;      /* offset = 0x0634 */
    uint32_t      HWA_SAFETY_DMEM5_ERR_ADDR                   ;      /* offset = 0x0638 */
    uint32_t      HWA_SAFETY_DMEM6_ERR_ADDR                   ;      /* offset = 0x063C */
    uint32_t      HWA_SAFETY_DMEM7_ERR_ADDR                   ;      /* offset = 0x0640 */
#endif
    uint32_t      HWA_SAFETY_DMEM_ERR_ADDR[8]                 ;      /* offset = 0x0624 - 0x0640 */
    uint32_t      HWA_SAFETY_WINDOW_RAM_ERR_ADDR              ;      /* offset = 0x0644 */
    uint32_t      MEM_ACCESS_ERR_STATUS                       ;      /* offset = 0x0648 */
    uint32_t      LOOP_CNT                                    ;      /* offset = 0x064C */
    uint32_t      PARAMADDR                                   ;      /* offset = 0x0650 */
#if 0
    uint32_t      PARAMADDR_CPUINTR0                          ;      /* offset = 0x0654 */
    uint32_t      PARAMADDR_CPUINTR1                          ;      /* offset = 0x0658 */
#endif
    uint32_t      PARAMADDR_CPUINTR[2]                        ;      /* offset = 0x0654 - 0x0658 */
    uint32_t      FSM_STATE                                   ;      /* offset = 0x065C */
    uint32_t      SINGLE_STEP_EN                              ;      /* offset = 0x0660 */
    uint32_t      SINGLE_STEP_TRIG                            ;      /* offset = 0x0664 */
    uint32_t      HWA_DMEM_A_BUS_SAFETY_CTRL                  ;      /* offset = 0x0668 */
    uint32_t      HWA_DMEM_A_BUS_SAFETY_FI                    ;      /* offset = 0x066C */
    uint32_t      HWA_DMEM_A_BUS_SAFETY_ERR                   ;      /* offset = 0x0670 */
    uint32_t      HWA_CFG_RESERVED_WORD1                      ;      /* offset = 0x0674 */
    uint32_t      HWA_DMEM_A_BUS_SAFETY_ERR_STAT_DATA0        ;      /* offset = 0x0678 */
    uint32_t      HWA_DMEM_B_BUS_SAFETY_CTRL                  ;      /* offset = 0x067C */
    uint32_t      HWA_DMEM_B_BUS_SAFETY_FI                    ;      /* offset = 0x0680 */
    uint32_t      HWA_DMEM_B_BUS_SAFETY_ERR                   ;      /* offset = 0x0684 */
    uint32_t      HWA_CFG_RESERVED_WORD2                      ;      /* offset = 0x0688 */
    uint32_t      HWA_DMEM_B_BUS_SAFETY_ERR_STAT_DATA0        ;      /* offset = 0x068C */
    uint32_t      HWA_CFG_RESERVED[606]                       ;      /* offset = 0x0690 - 0x1004 */
    uint32_t      LOCK0_KICK0                                 ;      /* offset = 0x1008 */
    uint32_t      LOCK0_KICK1                                 ;      /* offset = 0x100C */
    uint32_t      INTR_RAW_STATUS                             ;      /* offset = 0x1010 */
    uint32_t      INTR_ENABLED_STATUS_CLEAR                   ;      /* offset = 0x1014 */
    uint32_t      INTR_ENABLE                                 ;      /* offset = 0x1018 */
    uint32_t      INTR_ENABLE_CLEAR                           ;      /* offset = 0x101C */
    uint32_t      EOI                                         ;      /* offset = 0x1020 */
    uint32_t      FAULT_ADDRESS                               ;      /* offset = 0x1024 */
    uint32_t      FAULT_TYPE_STATUS                           ;      /* offset = 0x1028 */
    uint32_t      FAULT_ATTR_STATUS                           ;      /* offset = 0x102C */
    uint32_t      FAULT_CLEAR                                 ;      /* offset = 0x1030 */
}DSSHWACCRegs;


#ifdef __cplusplus
}
#endif

#endif /* HW_HWA_COMMONREG_V1_H */
/* END OF HW_HWA_COMMONREG_V1_H */
